In [5]:
import numpy as np 
import pandas as pd

### Series的计算

In [9]:
s1 = pd.Series([1,2,3], index = ['a','b','c'])
s2 = pd.Series([4,5,6,7], index = ['a','b','c','d'])

In [10]:
s1 + s2    # index对于的value相加

a    5.0
b    7.0
c    9.0
d    NaN
dtype: float64

### DataFrame的计算

In [14]:
df1 = pd.DataFrame(np.arange(4).reshape(2,2), index = ['a','b'], columns = ['北京','上海'])
df1

   北京  上海
a   0   1
b   2   3

In [16]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','b','c'], columns = ['北京','上海','广州'])
df2

   北京  上海  广州
a   0   1   2
b   3   4   5
c   6   7   8

In [17]:
df1 + df2

    上海   北京  广州
a  2.0  0.0 NaN
b  7.0  5.0 NaN
c  NaN  NaN NaN

### DataFrame的一些内置函数

In [19]:
df3 = pd.DataFrame(data = [[1,2,3],[4,5,np.NAN],[7,8,9]], index = ['a','b','c'], columns=['c1','c2','c3'])
df3

   c1  c2   c3
a   1   2  3.0
b   4   5  NaN
c   7   8  9.0

In [20]:
df3.sum()         # sum   会忽略nan，所以运算结果不是nan

c1    12.0
c2    15.0
c3    12.0
dtype: float64

In [21]:
df3.sum(axis = 1)     # 每一行的和

a     6.0
b     9.0
c    24.0
dtype: float64

In [22]:
df3.min()        # min

c1    1.0
c2    2.0
c3    3.0
dtype: float64

In [23]:
df3.min(axis = 1)   # 每一行的min

a    1.0
b    4.0
c    7.0
dtype: float64

In [24]:
df3.max()           # max

c1    7.0
c2    8.0
c3    9.0
dtype: float64

In [25]:
df3.max(axis = 1)   # 每一行的max

a    3.0
b    5.0
c    9.0
dtype: float64

In [26]:
df3.describe()         # 描述

        c1   c2        c3
count  3.0  3.0  2.000000
mean   4.0  5.0  6.000000
std    3.0  3.0  4.242641
min    1.0  2.0  3.000000
25%    2.5  3.5  4.500000
50%    4.0  5.0  6.000000
75%    5.5  6.5  7.500000
max    7.0  8.0  9.000000